<a href="https://colab.research.google.com/github/deverten/QuizA_Hamoye/blob/master/HamoyeA.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [9]:
import numpy as np

In [12]:
A = [1,2,3,4,5,6]
B = [13, 21, 34]
A.extend(B)

In [15]:
#Identity of a matrix
np.identity(3)
#np.array[(1,0,0),(0,1,0),(0,0,1)]

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [1]:
#importing all the necessary libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sn

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

**IMPORTING THE DATASETS**

In [18]:
url='https://github.com/WalePhenomenon/climate_change/blob/master/fuel_ferc1.csv?raw=true'
fuel_data = pd.read_csv(url)
fuel_data.head()

                record_id  ...  fuel_cost_per_mmbtu
0   f1_fuel_1994_12_1_0_7  ...                1.121
1  f1_fuel_1994_12_1_0_10  ...                1.120
2   f1_fuel_1994_12_2_0_1  ...                1.650
3   f1_fuel_1994_12_2_0_7  ...                1.970
4  f1_fuel_1994_12_2_0_10  ...                2.570

[5 rows x 11 columns]

In [ ]:
# To get a brief information of the data
fuel_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29523 entries, 0 to 29522
Data columns (total 11 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   record_id                     29523 non-null  object
 1   utility_id_ferc1              29523 non-null  int64
 2   report_year                   29523 non-null  int64
 3   plant_name_ferc1              29523 non-null  object
 4   fuel_type_code_pudl           29523 non-null  object
 5   fuel_unit                     29343 non-null  object
 6   fuel_qty_burned               29523 non-null  float64
 7   fuel_mmbtu_per_unit           29523 non-null  float64
 8   fuel_cost_per_unit_burned     29523 non-null  float64
 9   fuel_cost_per_unit_delivered  29523 non-null  float64
 10  fuel_cost_per_mmbtu           29523 non-null  float64
dtypes: float64(5), int64(2), object(4)
memory usage: 2.5+ MB

**DEALING WITH MISSING DATA**

In [ ]:
#To know which of the columns contain missing data
fuel_data.isnull().sum()

record_id                         0
utility_id_ferc1                  0
report_year                       0
plant_name_ferc1                  0
fuel_type_code_pudl               0
fuel_unit                       180
fuel_qty_burned                   0
fuel_mmbtu_per_unit               0
fuel_cost_per_unit_burned         0
fuel_cost_per_unit_delivered      0
fuel_cost_per_mmbtu               0
dtype: int64

In [ ]:
# In order to fill the missing blanks with values let's group the fuel_unit values first
fuel_data.groupby('fuel_unit')['fuel_unit'].count()

fuel_unit
bbl        7998
gal          84
gramsU      464
kgU         110
mcf       11354
mmbtu       180
mwdth        95
mwhth       100
ton        8958
Name: fuel_unit, dtype: int64

In [ ]:
# since the 'mcf' unit has more values compared to the others, filling the missing data's with 'mcf' would have little or no consequences on the analysis.
fuel_data[['fuel_unit']] = fuel_data[['fuel_unit']].fillna(value='mcf')

In [ ]:
# Checking if all empty values have been filled
fuel_data.isnull().sum()

record_id                       0
utility_id_ferc1                0
report_year                     0
plant_name_ferc1                0
fuel_type_code_pudl             0
fuel_unit                       0
fuel_qty_burned                 0
fuel_mmbtu_per_unit             0
fuel_cost_per_unit_burned       0
fuel_cost_per_unit_delivered    0
fuel_cost_per_mmbtu             0
dtype: int64

**GROUPING DATA**

In [20]:
ftca = fuel_data[['fuel_type_code_pudl','fuel_cost_per_unit_burned']].groupby('fuel_type_code_pudl').sum()
ftca

                     fuel_cost_per_unit_burned
fuel_type_code_pudl
coal                                576254.381
gas                                 156891.829
nuclear                            4053318.428
oil                                1361824.819
other                                 3048.394
waste                                 8607.492

In [21]:
fuel_data.describe()

       utility_id_ferc1  ...  fuel_cost_per_mmbtu
count      29523.000000  ...         29523.000000
mean         118.601836  ...            19.304354
std           74.178353  ...          2091.540939
min            1.000000  ...           -41.501000
25%           55.000000  ...             1.940000
50%          122.000000  ...             4.127000
75%          176.000000  ...             7.745000
max          514.000000  ...        359278.000000

[8 rows x 7 columns]

In [22]:
#Dealing with missing data
#To know which of the columns contain missing data
fuel_data.isnull().sum()

record_id                         0
utility_id_ferc1                  0
report_year                       0
plant_name_ferc1                  0
fuel_type_code_pudl               0
fuel_unit                       180
fuel_qty_burned                   0
fuel_mmbtu_per_unit               0
fuel_cost_per_unit_burned         0
fuel_cost_per_unit_delivered      0
fuel_cost_per_mmbtu               0
dtype: int64

In [23]:
#to get the percentage of missing data in each column
(fuel_data.isnull().sum()/len(fuel_data))*100

record_id                       0.000000
utility_id_ferc1                0.000000
report_year                     0.000000
plant_name_ferc1                0.000000
fuel_type_code_pudl             0.000000
fuel_unit                       0.609694
fuel_qty_burned                 0.000000
fuel_mmbtu_per_unit             0.000000
fuel_cost_per_unit_burned       0.000000
fuel_cost_per_unit_delivered    0.000000
fuel_cost_per_mmbtu             0.000000
dtype: float64

In [27]:
#To see the quantitiy of fuel cost per unit burned , we use the groupby method and sum the values
ft = fuel_data[['fuel_type_code_pudl','fuel_cost_per_unit_burned']].groupby('fuel_type_code_pudl').sum()
ft

                     fuel_cost_per_unit_burned
fuel_type_code_pudl
coal                                576254.381
gas                                 156891.829
nuclear                            4053318.428
oil                                1361824.819
other                                 3048.394
waste                                 8607.492

In [28]:
# To see the years with the highest fuel usage
years = fuel_data[['report_year','fuel_cost_per_unit_burned']].groupby('report_year').sum()
years

             fuel_cost_per_unit_burned
report_year
1994                        263292.115
1995                        425661.488
1996                         86425.275
1997                        163533.452
1998                        140238.656
1999                        126056.285
2000                        326495.434
2001                        180365.641
2002                        121921.135
2003                        149175.726
2004                        184637.699
2005                        135924.139
2006                        188142.032
2007                        256114.312
2008                        314312.022
2009                        263584.566
2010                        331581.467
2011                        374175.603
2012                        321693.544
2013                        306933.236
2014                        518002.469
2015                        260060.984
2016                        255484.814
2017                        244557.823
2018                        221575.426

In [29]:
#
fuel_data[['fuel_type_code_pudl','report_year','fuel_cost_per_unit_burned']].groupby(['fuel_type_code_pudl','report_year']).sum()

                                 fuel_cost_per_unit_burned
fuel_type_code_pudl report_year
coal                1994                         14984.572
                    1995                         14571.785
                    1996                         12694.803
                    1997                         43742.178
                    1998                         11902.597
...                                                    ...
waste               2014                           591.594
                    2015                           629.270
                    2016                           539.079
                    2017                           452.079
                    2018                           660.972

[148 rows x 1 columns]

In [31]:
# we can also group by the year, to see the years with the highest fuel cost per unit delivered
fuel_delivered = fuel_data[['report_year','fuel_cost_per_unit_delivered']].groupby('report_year').sum()
fuel_delivered

             fuel_cost_per_unit_delivered
report_year
1994                         7.859053e+04
1995                         3.931506e+04
1996                         1.000602e+07
1997                         1.218738e+07
1998                         3.178799e+05
1999                         2.682921e+04
2000                         1.352903e+06
2001                         8.142834e+04
2002                         5.735121e+04
2003                         6.740849e+04
2004                         1.663129e+05
2005                         5.258506e+04
2006                         4.805125e+04
2007                         5.476283e+04
2008                         7.194631e+04
2009                         7.975923e+05
2010                         1.158381e+05
2011                         7.412059e+04
2012                         7.581617e+04
2013                         2.065968e+05
2014                         2.256952e+05
2015                         3.569033e+05
2016                         1.074344e+05
2017                         4.587348e+04
2018                         4.748057e+05